app/views/home/_navbar.erb

                    <li class="divider"></li>
                    <% @univ = Univ.all %>
---
SELECT "univs".* FROM "univs"