app/controllers/home_controller.rb

SELECT "univs".* FROM "univs"
---
  def index
    ## 각 학교 소개 페이지로 넘어갈 버튼 만들기 ##
    @univ_detail = Univ.all

SELECT "question_posts".* FROM "question_posts"
---
  def question
    @question_post = QuestionPost.all

INSERT INTO "univs" ("univ_name", "univ_code", "univ_logo", "univ_leader_name", "univ_leader_picture", "univ_howmany_team", "univ_howmany_people", "univ_where", "univ_introduce", "univ_our_picture1", "univ_our_picture2", "univ_our_picture3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def univ_db
      data = Univ.new
      data.univ_name =            params[:univ_name]                     #학교이름
      data.univ_code =            params[:univ_code]                     #학교 코드 => 코드표 띄워둘것
      data.univ_logo =            params[:univ_logo]                     #학교로고
      data.univ_leader_name =     params[:univ_leader_name]       #1.학교대표이름
      data.univ_leader_picture =  params[:univ_leader_picture] #.학교대표사진
      data.univ_howmany_team =    params[:univ_howmany_team]     #2.팀 갯수
      data.univ_howmany_people =  params[:univ_howmany_people] #3.전체 정원
      data.univ_where =           params[:univ_where]                   #4.소재지역 도 / 시(구, 군) / 동(면)
      data.univ_introduce =       params[:univ_introduce]           #5.학교3기 소개
      data.univ_our_picture1 =    params[:univ_our_picture1]     #6.학교3기 활동사진1
      data.univ_our_picture2 =    params[:univ_our_picture2]     #7.학교3기 활동사진2
      data.univ_our_picture3 =    params[:univ_our_picture3]     #8.학교3기 활동사진3
      data.save

SELECT  "univs".* FROM "univs" WHERE "univs"."id" = ? LIMIT 1  [["id", nil]]
---
  def univ_detail
    @detail = Univ.find(params[:id])